utn-fra-lse/lpc845/ejemplos/sdks/01_blinky_sdk/components/osa/fsl_os_abstraction.h
/*! @brief Priority setting for OSA. */
#ifndef OSA_PRIORITY_IDLE
#define OSA_PRIORITY_IDLE (6U)
#endif

#ifndef OSA_PRIORITY_LOW
#define OSA_PRIORITY_LOW (5U)
#endif

#ifndef OSA_PRIORITY_BELOW_NORMAL
#define OSA_PRIORITY_BELOW_NORMAL (4U)
#endif

#ifndef OSA_PRIORITY_NORMAL
#define OSA_PRIORITY_NORMAL (3U)
#endif

#ifndef OSA_PRIORITY_ABOVE_NORMAL
#define OSA_PRIORITY_ABOVE_NORMAL (2U)
#endif

#ifndef OSA_PRIORITY_HIGH
#define OSA_PRIORITY_HIGH (1U)
#endif

#ifndef OSA_PRIORITY_REAL_TIME
#define OSA_PRIORITY_REAL_TIME (0U)
#endif

#ifndef OSA_TASK_PRIORITY_MAX
#define OSA_TASK_PRIORITY_MAX (0U)
#endif

#ifndef OSA_TASK_PRIORITY_MIN
#define OSA_TASK_PRIORITY_MIN (15U)
#endif

/*
 * Converse the percent of the priority to the priority of the OSA.
 * The the range of the parameter x is 0-100.
 */
#define OSA_TASK_PRIORITY_PERCENT(x) \
    ((((OSA_TASK_PRIORITY_MIN - OSA_TASK_PRIORITY_MAX) * (100 - (x))) / 100) + OSA_TASK_PRIORITY_MAX)

#define SIZE_IN_UINT32_UNITS(size) (((size) + sizeof(uint32_t) - 1) / sizeof(uint32_t))

/*! @brief Constant to pass as timeout value in order to wait indefinitely. */
#define osaWaitNone_c            ((uint32_t)(0UL))
#define osaWaitForever_c         ((uint32_t)(~0UL))
#define osaEventFlagsAll_c       ((osa_event_flags_t)(0x00FFFFFF))
#define osThreadStackArray(name) osThread_##name##_stack
#define osThreadStackDef(name, stacksize, instances) \
    const uint32_t osThreadStackArray(name)[SIZE_IN_UINT32_UNITS(stacksize) * (instances)];

/* ==== Thread Management ==== */

/* Create a Thread Definition with function, priority, and stack requirements.
 * \param         name         name of the thread function.
 * \param         priority     initial priority of the thread function.
 * \param         instances    number of possible thread instances.
 * \param         stackSz      stack size (in bytes) requirements for the thread function.
 * \param         useFloat
 */
#if defined(SDK_OS_MQX)
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)               \
    osa_thread_link_t osThreadLink_##name[instances] = {0};                         \
    osThreadStackDef(name, stackSz, instances)                                      \
        osa_task_def_t os_thread_def_##name = {(name),                              \
                                               (priority),                          \
                                               (instances),                         \
                                               (stackSz),                           \
                                               (uint8_t *)osThreadStackArray(name), \
                                               osThreadLink_##name,                 \
                                               (uint8_t *)#name,                    \
                                               (useFloat)}
#elif defined(SDK_OS_UCOSII)
#if gTaskMultipleInstancesManagement_c
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)               \
    osa_thread_link_t osThreadLink_##name[instances] = {0};                         \
    osThreadStackDef(name, stackSz, instances)                                      \
        osa_task_def_t os_thread_def_##name = {(name),                              \
                                               (priority),                          \
                                               (instances),                         \
                                               (stackSz),                           \
                                               (uint8_t *)osThreadStackArray(name), \
                                               osThreadLink_##name,                 \
                                               (uint8_t *)#name,                    \
                                               (useFloat)}
#else
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)                          \
    osThreadStackDef(name, stackSz, instances) osa_task_def_t os_thread_def_##name = {         \
        (name), (priority),       (instances), (stackSz), (uint8_t *)osThreadStackArray(name), \
        NULL,   (uint8_t *)#name, (useFloat)}
#endif
#elif defined(FSL_RTOS_THREADX)
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)                                             \
    uint32_t s_stackBuffer##name[(stackSz + sizeof(uint32_t) - 1U) / sizeof(uint32_t)];                           \
    static const osa_task_def_t                                                                                   \
        os_thread_def_##name = {(name), (priority),       (instances), (stackSz), (uint8_t *)s_stackBuffer##name, \
                                NULL,   (uint8_t *)#name, (useFloat)}
#elif defined(__ZEPHYR__)
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat) \
    K_THREAD_STACK_DEFINE(name##_stack, (stackSz));                   \
    const osa_task_def_t os_thread_def_##name = {                     \
        (name), (priority), (instances), (stackSz), (uint8_t *)name##_stack, NULL, (uint8_t *)#name, (useFloat)}
#else
#if (defined(configSUPPORT_STATIC_ALLOCATION) && (configSUPPORT_STATIC_ALLOCATION > 0U)) && \
    !((defined(configSUPPORT_DYNAMIC_ALLOCATION) && (configSUPPORT_DYNAMIC_ALLOCATION > 0U)))
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)                                             \
    uint32_t s_stackBuffer##name[(stackSz + sizeof(uint32_t) - 1U) / sizeof(uint32_t)];                           \
    static const osa_task_def_t                                                                                   \
        os_thread_def_##name = {(name), (priority),       (instances), (stackSz), (uint8_t *)s_stackBuffer##name, \
                                NULL,   (uint8_t *)#name, (useFloat)}
#else
#define OSA_TASK_DEFINE(name, priority, instances, stackSz, useFloat)                             \
    const osa_task_def_t os_thread_def_##name = {(name), (priority), (instances),      (stackSz), \
                                                 NULL,   NULL,       (uint8_t *)#name, (useFloat)}
#endif
#endif
/* Access a Thread defintion.
 * \param         name          name of the thread definition object.
 */
#define OSA_TASK(name) (const osa_task_def_t *)&os_thread_def_##name

#define OSA_TASK_PROTO(name) extern osa_task_def_t os_thread_def_##name
/*  ==== Timer Management  ====
 * Define a Timer object.
 * \param         name          name of the timer object.
 * \param         function      name of the timer call back function.
 */

#define OSA_TIMER_DEF(name, function) osa_time_def_t os_timer_def_##name = {(function), NULL}

